<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Notion. Set DOWNLOAD_URL with the required download
            url: x86_64: https://www.notion.so/desktop/mac/download arm64:
            https://www.notion.so/desktop/apple-silicon/download </string>
        <key>Identifier</key>
        <string>com.github.munki-tvlk.download.Notion</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Notion</string>
            <key>USER_AGENT</key>
            <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_0) AppleWebKit/537.36 (KHTML, like
                Gecko) Chrome/69.0.3497.100 Safari/537.36</string>
            <key>DOWNLOAD_URL</key>
            <string>https://www.notion.so/desktop/mac-universal/download</string>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>%DOWNLOAD_URL%</string>
                    <key>filename</key>
                    <string>%NAME%.dmg</string>
                    <key>request_headers</key>
                    <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                    </dict>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Notion.app</string>
                    <key>requirement</key>
                    <string>identifier "notion.id" and anchor apple generic and certificate
                        1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
                        leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
                        leaf[subject.OU] = LBQJ96FQ8D</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>