<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Notion and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.munki-tvlk.munki.Notion</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>Notion</string>
            <key>pkginfo</key>
            <dict>
                <key>blocking_applications</key>
                <array>
                    <string>Notion</string>
                </array>
                <key>catalogs</key>
                <array>
                    <string>Testing</string>
                </array>
                <key>category</key>
                <string>Productivity</string>
                <key>description</key>
                <string>A unified workspace for modern teams.</string>
                <key>developer</key>
                <string>Notion Labs, Inc.</string>
                <key>display_name</key>
                <string>Notion</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>postinstall_script</key>
                <string>#!/bin/sh /usr/bin/chgrp -R staff /Applications/Notion.app &amp;&amp;
                    /bin/chmod -R 775 /Applications/Notion.app </string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.1</string>
        <key>ParentRecipe</key>
        <string>com.github.munki-tvlk.download.Notion</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>