<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads and imports the latest version of Microsoft Teams pkg into Munki.</string>
        <key>Identifier</key>
        <string>com.github.munki-tvlk.MSTeams.munki</string>
        <key>MinimumVersion</key>
        <string>0.2.3</string>
        <key>ParentRecipe</key>
        <string>com.github.munki-tvlk.download.MSTeams</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/MSTeams</string>
            <key>NAME</key>
            <string>Microsoft Teams</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>Testing</string>
                </array>
                <key>category</key>
                <string>Communication</string>
                <key>description</key>
                <string>Microsoft Teams is a collaborative tool designed to bring teams together
                    with chat, meetings, and file sharing.</string>
                <key>display_name</key>
                <string>Microsoft Teams</string>
                <key>name</key>
                <string>Microsoft Teams</string>
                <key>unattended_install</key>
                <true />
            </dict>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                    <key>pkginfo</key>
                    <string>%pkginfo%</string>
                </dict>
            </dict>
        </array>
    </dict>
</plist>