<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Homebrew.</string>
        <key>Identifier</key>
        <string>com.github.munki-tvlk.munki.Homebrew</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Homebrew</string>
        </dict>
        <key>MinimumVersion</key>
        <string>2.3.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>asset_regex</key>
                    <string>Homebrew-[0-9]+.[0-9]+.[0-9]+.pkg</string>
                    <key>github_repo</key>
                    <string>Homebrew/brew</string>
                </dict>
                <key>Processor</key>
                <string>GitHubReleasesInfoProvider</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>filename</key>
                    <string>%NAME%-%version%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>URLDownloader</string>
            </dict>
            <dict>
                <key>Processor</key>
                <string>EndOfCheckPhase</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>input_path</key>
                    <string>%pathname%/Homebrew</string>
                </dict>
                <key>Processor</key>
                <string>CodeSignatureVerifier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>expected_authority_names</key>
                    <string> - "Developer ID Installer: Mike McQuaid (6248TWFRH6)" - Developer ID
                        Certification Authority - Apple Root CA </string>
                    <key>input_plist_path</key>
                    <string>%pathname%/Homebrew/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
                <key>Processor</key>
                <string>Versioner</string>
            </dict>
        </array>
    </dict>
</plist>