<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of Homebrew and imports it into Munki.</string>
        <key>Identifier</key>
        <string>com.github.munki-tvlk.munki.Homebrew</string>
        <key>Input</key>
        <dict>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>NAME</key>
            <string>Homebrew</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>Testing</string>
                </array>
                <key>display_name</key>
                <string>Homebrew</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true />
                <key>unattended_uninstall</key>
                <true />
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>1.0.0</string>
        <key>ParentRecipe</key>
        <string>com.github.munki-tvlk.download.Homebrew</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>