<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Microsoft Edge installer and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.munki-tvlk.munki.MicrosoftEdge</string>
        <key>ParentRecipe</key>
        <string>com.github.munki-tvlk.download.MicrosoftEdge</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Microsoft Edge</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/%NAME%</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>Testing</string>
                </array>
                <key>description</key>
                <string>Microsoft Edge web browser</string>
                <key>display_name</key>
                <string>Microsoft Edge</string>
                <key>developer</key>
                <string>Microsoft</string>
                <key>category</key>
                <string>Productivity</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>minimum_os_version</key>
                <string>10.10.0</string>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>