<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of GitHub Desktop and imports it into Munki.</string>
		<key>Identifier</key>
		<string>com.github.munki-tvlk.munki.GitHubDesktop</string>
		<key>Input</key>
		<dict>
			<key>MUNKI_REPO_SUBDIR</key>
			<string>apps/GitHub Desktop (Apple)</string>
			<key>NAME</key>
			<string>GitHub Desktop (Apple)</string>
			<key>pkginfo</key>
			<dict>
				<key>catalogs</key>
				<array>
					<string>Testing</string>
				</array>
				<key>description</key>
				<string>Desktop app made by GitHub for seamless contribution to git projects.</string>
				<key>developer</key>
				<string>GitHub, Inc.</string>
				<key>display_name</key>
				<string>GitHub Desktop (Apple)</string>
				<key>name</key>
				<string>%NAME%</string>
				<key>supported_architectures</key>
				<array>
					<string>arm64</string>
				</array>
				<key>postinstall_script</key>
				<string>#!/bin/bash DEST_DIR="/usr/local/bin" if [[ ! -d "$DEST_DIR" ]]; then mkdir
					-p "$DEST_DIR" fi ln -s "/Applications/GitHub
					Desktop.app/Contents/Resources/app/static/github.sh" "$DEST_DIR/github" exit 0 </string>
				<key>preinstall_script</key>
				<string>#!/bin/bash DEST_DIR="/usr/local/bin" # Remove old symbolic links associated
					with pre-Electron version of GitHub Desktop. if [[ -L "$DEST_DIR/git-lfs" ]];
					then rm -f "$DEST_DIR/git-lfs" fi exit 0 </string>
				<key>unattended_install</key>
				<true />
			</dict>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.2</string>
		<key>ParentRecipe</key>
		<string>com.github.munki-tvlk.download.GitHubDesktop</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
					<key>dmg_root</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
				</dict>
				<key>Processor</key>
				<string>DmgCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%dmg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
	</dict>
</plist>