<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of GitHub Desktop. Valid BUILD arguments are: -
			"darwin": Downloads GitHub Desktop for Intel Macs - "darwin-arm64": Downloads GitHub
			Desktop for Apple Silicon Macs </string>
		<key>Identifier</key>
		<string>com.github.munki-tvlk.download.GitHubDesktop-x86</string>
		<key>Input</key>
		<dict>
			<key>BUILD</key>
			<string>darwin</string>
			<key>NAME</key>
			<string>GitHub Desktop (Intel)</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0.2</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>GitHubDesktop-%BUILD%.zip</string>
					<key>url</key>
					<string>https://central.github.com/deployments/desktop/desktop/latest/%BUILD%</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
					<key>purge_destination</key>
					<true />
				</dict>
				<key>Processor</key>
				<string>Unarchiver</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/GitHub Desktop.app</string>
					<key>requirement</key>
					<string>(identifier "com.github.GitHub" or identifier "com.github.GHAskPass")
						and anchor apple generic and certificate
						leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or anchor apple generic
						and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and
						certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and
						certificate leaf[subject.OU] = VEKTX9H2N7</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/GitHub
						Desktop.app/Contents/Info.plist</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
		</array>
	</dict>
</plist>