<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current version of iTerm2. Set RELEASE to either "final" or "testing".
			For iTerm2 version 3 beta, set RELEASE to "testing3".</string>
		<key>Identifier</key>
		<string>com.github.munki-tvlk.download.iTerm2</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>iTerm2</string>
			<key>RELEASE</key>
			<string>final</string>
		</dict>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>https://iterm2.com/appcasts/%RELEASE%_new.xml</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unarchiver</string>
				<key>Arguments</key>
				<dict>
					<key>archive_path</key>
					<string>%pathname%</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
					<key>purge_destination</key>
					<true />
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/iTerm.app</string>
					<key>requirement</key>
					<string>identifier "com.googlecode.iterm2" and anchor apple generic and
						certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
						leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
						leaf[subject.OU] = H7V7XYVQ7D</string>
					<key>strict_verification</key>
					<true />
				</dict>
			</dict>
		</array>
	</dict>
</plist>