<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the current release version of iTerm 2.</string>
		<key>Identifier</key>
		<string>com.github.munki-tvlk.download.iTerm2</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>iTerm2</string>
			<key>SPARKLE_FEED_URL</key>
			<string>https://iterm2.com/appcasts/final_new.xml</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>appcast_url</key>
					<string>%SPARKLE_FEED_URL%</string>
				</dict>
				<key>Processor</key>
				<string>SparkleUpdateInfoProvider</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>filename</key>
					<string>%NAME%.zip</string>
					<key>pathname</key>
					<string>
						/Users/travelokadmin/Library/AutoPkg/Cache/com.github.munki-tvlk.munki.iTerm2/downloads/iTerm2.zip</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>Unzipper</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
					<key>requirement</key>
					<string>anchor apple generic and identifier "com.googlecode.iterm2" and
						(certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or
						certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate
						leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate
						leaf[subject.OU] = H7V7XYVQ7D)</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>